Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/public_transport/rail_services_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Iarnród Éireann (or Irish Rail), a subsidiary company of a State-owned company, Coras Iompair Éireann (CIÉ), is responsible for operating rail services
ga: Fochuideachta de chuid Chóras Iompair Éireann (CIE) comlacht atá in úinéireacht an Stáit, is ea Iarnród Éireann

source: Iarnród Éireann falls under the remit of the Department of Transport, Tourism and Sport
ga: Tá sí freagrach as seirbhísí traenach a riaradh. Tagann Iarnód Éireann faoin Roinn Iompair

source: The company operates passenger rail services nationwide and provides commuter rail services, including the DART service in Dublin. Many stations have park and ride facilities to encourage commuters to leave their cars in station car parks and reduce the volume of traffic
ga: Cuireann an comhlacht seirbhísí traenach do phaisinéirí ar fáil ar fud na tíre agus chomh maith leis sin soláthraíonn sé an seirbhísí iarnróid do chomaitéirí, lena n-áirítear an tseirbhís DART i mBaile Átha Cliath

source: Free travel on State rail services is available to everyone permanently living in Ireland that is aged 66 and over
ga: Tá saorthaisteal ar sheirbhísí iarnróid an Stáit ar fáil do gach duine go buan ina gcónaí in Éirinn atá 66 bliana d'aois agus os a chionn

source: Certain people under that age are also entitled
ga: Tá daoine áirithe faoi an aois sin i dteideal

source: Read further information about Free Travel here
ga: Léigh tuilleadh eolais faoi Saorthaistil anseo

source: The DART (Dublin Area Rapid Transport) runs along the east coast of Ireland from Malahide in county Dublin to Greystones in county Wicklow
ga: Ritheann an DART (Iompar sciobtha Bhaile Átha Cliath agus a cheantracha) taobh le cósta Oirthear na hÉireann ó Mhullach Íde i gContae Bhaile Átha Cliath go dtí Na Clocha Liath i gContae Chill Mhantáin

source: Details of the facilities available in all DART stations and DART timetables are available on the Iarnród Éireann website
ga: Tá sonraí na n-áiseanna atá ar fáil i ngach stáisiún DART agus Cláir Ama DART ar fáil ar shuíomh idirlín Iarnróid Éireann

source: DART fares can be paid in cash or passengers can buy pre-paid tickets to avail of discounts on their journeys
ga: Is féidir táillí a íoc le hairgead glan nó is féidir le paisinéirí ticéid a cheannach roimh ré chun leas a bhaint as lascainí i gcomhair a dturas

source: You can also use Leap Cards
ga: Is féidir leat úsáid a bhaint freisin Cártaí Leap

source: Commuter services operate in the Dublin area between Dundalk, Dunboyne, Longford, Portlaoise and Gorey
ga: Oibríonn seirbhísí comaitéara i gceantar Bhaile Átha Cliath idir Dún Dealgan, Dún Búinne, Longfort, Port Laoise agus Guaire

source: There are also commuter services in the Cork area between Mallow, Cobh and Midleton
ga: Tá seirbhísí comaitéara i gceantar Chorcaí idir Mala, Cóbh go Mainistir na Corann chomh maith

source: Commuter rail network maps, commuter rail fare information and commuter timetables for all services are available on the Iarnród Éireann website. You can use Leap Cards on commuter services
ga: Tá Léarscáileanna den ghréasán traenach comaitéara, eolas faoi tháillí agus cláir ama do na seirbhísí ar fad ar fáil ar shuíomh idirlín Iarnróid Éireann.Is féidir leat úsáid a bhaint Cártaí Leap

source: Iarnród Éireann's InterCity services provide rail links between main towns and cities
ga: Cuireann seirbhísí idirchathracha Iarnróid Éireann ceangail traenach ar fáil idir príomhbhailte agus cathracha

source: InterCity services depart from Dublin's Heuston and Connolly Stations and serve the following destinations: Belfast, Sligo, Ballina, Westport, Galway, Limerick, Ennis, Tralee, Cork, Waterford and Rosslare Europort
ga: Imíonn seirbhísí idirchathracha ó Stáisiún Heuston agus Stáisiún Uí Chonghaile, agus cuireann siad seirbhís ar fáil chuig na háiteanna seo a leanas: Béal Féirste, Sligeach, Béal an Átha, Cathair na Mart, Gaillimh, Luimneach, Inis, Trá Lí, Corcaigh, Port Láirge agus Europort Ros Láir

source: The Enterprise service operates between Belfast and Dublin and is jointly run by Iarnród Éireann and Northern Ireland Rail
ga: Feidhmionn an tseirbhís Enterprise idir Béal Feirste agus Baile Átha Cliath agus comhsholáthraíonn Iarnród Éireann agus Northern Ireland Rail an tseirbhís

source: Other InterCity services run between Rosslare Europort and Limerick; Cork and Tralee; Cork and Limerick; and Limerick and Galway
ga: Ritheann seirbhísí idircathracha eile idir Europort Ros Láir agus Luimneach; Corcaigh agus Trá Lí; Corcaigh agus Luimneach; agus Luimneach agus Gaillimh

source: The InterCity service has carriages divided between first class and standard class
ga: Freastalaíonn an tseirbhís Idirchathracha roinntear na carráistí idir rang a haon agus rang caighdeánach

source: You can find information about tickets for UK rail services and for European rail services on Iarnród Éireann's web site
ga: Tá eolas ar fáil faoi thicéid agus cláir ama roinnt seirbhísí traenacha sa Ríocht Aontaithe agus san Eorap ar shuíomh idirlín Iarnród Éireann

source: Services for passengers with disabilities
ga: Seirbhísí do phaisinéirí le míchumais

source: Special arrangements can be made for passengers with disabilities but it is recommended that you contact the relevant station or Iarnród Éireann's Mobility Impaired Liaison Office at least 24 hours before your journey and give them some details of your travel plans
ga: Féadfar socruithe speisialta a dhéanamh do phaisinéirí le míchumais, ach moltar duit dul i dteagmháil leis an stáisiún ábhartha nó Oifig Theagmhála do dhaoine le Míchumas Gluaiseachta ag Iarnród Éireann ar a laghad 24 uair roimh tús an turais agus cuid de shonraí do phleananna taistil a thabhairt dóibh

source: These details should include:
ga: Ba cheart go gclúdófaí na rudaí seo a leanas:

source: • When your train is scheduled to depart from
ga: • Cén t-am agus cén áit a mbeidh do thraen ag fágáil

source: • Where you are going and if you need to change trains on your journey
ga: • Cá bhfuil tú ag dul agus an gcaithfidh tú aistriú idir thraenacha i rith do thurais

source: • The nature of your disability
ga: • An cineál míchumais atá ort

source: • Whether you will be travelling alone or with a companion
ga: • An mbeidh tú ag taisteal i d'aonar nó in éineacht le compánach

source: • Whether you need help arriving or departing from the station
ga: • An mbeidh cúnamh uait agus tú ag teacht nó ag imeacht ón stáisiún

source: If there is a change or cancellation of your journey you should notify the relevant Iarnród Éireann staff
ga: Ba cheart duit foireann chuí Iarnród Éireann a chur ar an eolas maidir le hathrú ar bith a thagann ar do thuras nó má tá sé le cur ar ceal

source: Some stations can arrange for a car-parking space for wheelchair users and all stations have disabled access to at least one platform
ga: Tá cuid de na stáisiúin in ann spás chun carr a phairceáil a chur ar fáil d'úsáideoirí cathaoireacha rothaí agus tá rochtain do dhaoine le míchumas chuig ar a laghad ardán amháin i chuile stáisiún

source: Portable ramps are available at most stations for wheelchair users travelling on intercity and commuter trains to enable them to board from the platform to the carriage
ga: Bíonn ardán inaistrithe ar fáil sa chuid is mó staisiún d'úsáideoirí cathaoireacha rothaí atá ag taisteal ar thraenacha idircathracha agus traenacha comaitéara chun go mbeidh siad in ann bordáil ón ardán isteach sa charráiste

source: If a group of people using wheelchairs are travelling together, Iarnród Éireann will need to be notified in advance so that the necessary accommodation can be provided
ga: Má tá grúpa daoine a úsáideann cathaoireacha rothaí ag taisteal le chéile ba cheart Iarnród Éireann a chur ar an eolas roimh ré ionas gur féidir na háiseanna riachtanacha a chur ar fáil

source: DART trains can be accessed directly from platforms and the trains have wide doors and a large area to accommodate wheelchairs
ga: Is féidir rochtain a fháil díreach ó na hárdain chuig traenacha DART agus tá doirse leathana ar na traenacha agus spás fairsing do chathaoireacha rothaí

source: Most mainline and suburban and all DART stations have public address systems giving details of trains and services for people with visually impairments
ga: Tá córas glórfhógartha ag an gcuid is mó de na stáisiúin phríomhlíne agus fobhailteacha agus ag na stáisiúin DART uilig chun sonraí traenacha agus seirbhísí a thabhairt do dhaoine le míchumais amhairc

source: Tactile tiles have been put in place in some stations to help people with visually impairments and Braille-coded buttons and a talking lift mechanism are features of newer station lifts
ga: Tá leacáin tadhlacha curtha ar fáil i gcuid de na stáisiúin chun cúnamh a thabhairt do dhaoine le míchumais amhairc agus in ardaitheoirí i stáisiúin níos nua, tá cnaipí le códanna Braille agus teicnic "ardaitheoir a labhraíonn"

source: You can check the facilities for disabled passengers available at any station in the Iarnród Éireann network by checking its web site
ga: Is féidir na háiseanna atá ar fáil i stáisiún ar bith i ngréasán Iarnróid Éireann a sheiceáil ach breathnú ar a shuíomh idirlín

source: You can also find a guide for rail passengers with disabilities on its website
ga: Tá treoir do phaisinéirí d'iarnród faoi mhíchumas ar a shuíomh gréasáin freisin

source: Guide and assistance dogs are permitted to travel on all services without restriction
ga: Tá cead treoir agus cúnamh madraí taisteal ar gach seirbhís gan srian

source: Pets are allowed to travel on DART or commuter trains provided they are properly restrained
ga: Tá cead ag peataí taisteal ar DART nó comaitéara traenacha choinníoll go bhfuil siad srian i gceart

source: Dogs can only travel on intercity trains in the guard's van (non-passenger compartment)
ga: Is féidir madraí taisteal ach amháin ar thraenacha idirchathracha sa garda veain (urrann neamh-paisinéirí)

source: Luggage should be placed in the specially provided luggage racks, overhead racks or in-between seat spaces
ga: Ba cheart bagáiste a chur sna racaí bagáiste, racaí lasnairde nó i-idir spásanna suíochán atá ar fáil go speisialta

source: You must also make sure your luggage is not causing inconvenience for other passengers
ga: Ní foláir duit chomh maith a dhéanamh cinnte nach bhfuil do bhagáiste ag cur isteach ar phaisinéirí eile

source: Information on carrying bicycles on trains is available on the Iarnród Éireann website
ga: Tá eolas ar rothair sheolann ar thraenacha ar fháil ar shuíomh idirlín Iarnród Éireann

source: If you have complaints about Iarnród Éireann services, you should bring them to the attention of the relevant station manager
ga: Má tá gearáin agat faoi sheirbhísí Iarnróid Éireann ba cheart iad a chur faoi bhráid bhainisteoir an stáisiúin chu

source: If you want to take your complaint further, you can contact Customer Relations, Connolly Station, Dublin 1
ga: Má tá tú ag iarraidh dul níos faide le do ghearán, d'fhéadfá dul i dteagmháil le Caidreamh le Custaiméirí, Stáisiún Uí Chonghaile, Baile Átha Cliath 1

source: It is recommended that you write a letter of complaint, including as much detail as possible (date and time of travel, where you were travelling from and to and a phone number)
ga: Moltar duit litir gearáin a scríobh a chlúdaíonn an oiread sonraí agus is féidir (dáta agus am taistil, an áit óna raibh tú ag taisteal, an áit a bhí tú ag taisteal chuici agus uimhir fóin)

source: You should also send your ticket, if you still have it
ga: Ba cheart duit do thicéad a sheoladh, chomh maith, má tá sé fós agat

source: You may get an immediate response to your complaint but if not, you will get an acknowledgement within 3 days and you should have a full response within 15 days
ga: B'fhéidir go bhfaighfeá freagra ar do ghearán láithreach ach muna bhfaigheann, gheobhaidh tú admháil taobh istigh de thrí lá, agus ba cheart duit freagra iomlán a fháil taobh istigh de 15 lá

source: You may also make complaints or raise customer services issues online
ga: Is féidir chomh maith gearán a dhéanamh nó ceist faoi sheirbhís chustaiméara a chur ar an idirlíon

source: If your service is seriously delayed for any reason within the control of Iarnród Éireann, you could be entitled to a discount voucher
ga: Má tá moill fhada curtha do sheirbhís de bharr cúise ar bith atá faoi smacht Iarnróid Éireann, d'fheadfá a bheith i dteideal dearbhán lascaine

source: The value of discount voucher is based on the length of delay and the fare you have paid for your single journey (that is, approximately half the value of a return fare)
ga: Braitheann luach na ndearbhán lascaine ar fhad na moille agus an táille a d'íoc tú ar do thuras singil (sé sin, thart ar leath luach thicéad fillte)

source: Refunds in discount vouchers are also given if your seat reservation is not honoured and no seat of the same standard is available to you
ga: Eisítear dearbháin lascaine chomh maith muna dtugtar suíochán duit a chuir tú in áirithe sa chás nach bhfuil suíochán eile den chaighdeán céanna ar fáil duit

source: If the train you planned to catch is delayed or cancelled and you decide not to travel, you will be given a full cash refund if you return your unused ticket immediately to the ticket office where you bought it
ga: Má chuirtear do thraen ar ceal nó má tá moill air agus má shocraíonn tú gan an turas a dhéanamh, tabharfar aisíocaíocht duit in airgead tirim má thugann tú an ticéad nár úsáideadh ar ais láithreach go dtí an oifig inar cheannaigh tú é

source: If you decide for some other reason not to use a rail ticket you have bought, you can apply for a refund at any main InterCity station, the Dart office in Pearse Station or any Travel Centre
ga: Má shocraíonn tú ar chúis ar bith gan ticéad traenach atá ceannaithe agat a úsáid, d'fhéadfá iarratas a dhéanamh ar aisíocaíocht ag príomhstáisiún Idirchathrach ar bith, oifig DART i Stáisiún an Phiarsaigh, nó i Lárionad taistil ar bith

source: There may be an administration fee
ga: D'fhéadfadh táille riaracháin a bheith i gceist

source: If you did not buy your ticket from Iarnród Éireann, you should return it to the place where you bought it
ga: Mura cheannaigh tú do thicéad ó Iarnród Éireann, ba cheart duit é a thabhairt ar ais chuig an áit inár cheannaigh tú é

source: The ticket issuer will arrange any refund due and may make a reasonable administration charge
ga: Socróidh eisitheoir an ticéid aisíocaíocht ar bith atá dlíte agus d'fhéadfadh sé táille réasúnta riaracháin a ghearradh

source: Each train station has a lost property office where items found on trains will be handed in and kept for collection
ga: Tá oifig na mbeart caillte i ngach stáisiún agus tugtar rudaí faighte ar thraenacha isteach ansin, áit a choinnítear iad go dtí mbailítear iad

source: For more details, you should contact the relevant station directly
ga: Ba cheart dul i dteagmháil leis an stáisiún cuí le tuilleadh eolais a fháil

source: Obstructions on railway lines and bridges
ga: Baic ar línte iarnróid agus ar dhroichid

source: Section 14 of the Non-Fatal Offences Against the Person Act 1997 makes it an offence to endanger rail traffic
ga: Foráiltear in Alt 14 den Acht um Chionta Neamh-Mharfacha in aghaidh an Duine, 1997 gur cion é trácht iarnróid a chur i mbaol

source: This includes throwing any dangerous obstruction on a railway, tampering with any railway machinery, etc
ga: Áirítear leis seo aon bhac baolach a chaitheamh ar iarnród, baint d’aon innealra iarnróid etc

source: The Act also prohibits tampering with any signalling equipment, or devices used to control railway traffic
ga: Toirmisctear san Acht, chomh maith, baint d’aon trealamh comharthaíochta, nó de ghléasanna a úsáidtear chun trácht iarnróid a rialú

source: If tried in a District Court before a judge, the maximum penalty for these offences is a class C fine or 12 months in prison or both
ga: Má dhéantar thú a thriail sa Chúirt Dúiche os comhair breithimh, is é an pionós uasta do na cionta seo fíneáil aicme C nó 12 mhí sa phríosún nó an dá rud

source: If these offences are tried in a Circuit or Central Criminal Court, the maximum penalty is a fine or 7 years imprisonment or both
ga: Má dhéantar thú a thriail sa Chúirt Chuarda nó sa Phríomh-Chúirt Choiriúil, is é an pionós uasta ná fíneáil nó príosúnacht 7 mbliana nó an dá rud

source: Tickets vary depending on the service you use and you can get full details of leisure fares , commuter travel fares and UK and European rail fares from the Iarnród Éireann web site
ga: Braitheann táillí ar an tseirbhís a úsáidtear agus tá sonraí iomlán ar fáil faoi tháillí siamsaíochta, táillí do thaisteal lae agus táillí traenacha sa Ríocht Aontaithe agus san Eorap ó shuíomh idirlín Iarnróid Éireann

source: Prepaid tickets can be bought from ticket offices, ticket machines and online
ga: Is féidir ticéid íoctha roimh ré a cheannach ó na hoifigí ticéid uilig

source: Discounted fares are available with the correct identification card
ga: Cuirtear táillí lascaine ar fáil ach an cárta aitheantais chuí a thaispeáint

source: Leap Cards can be used on DART and commuter services
ga: Is féidir Leap Cártaí a úsáid ar sheirbhísí DART agus comaitéara

source: The Student Leap Card allows students to get substantially discounted fares on Iarnród Eireann services
ga: Ceadaíonn an Cárta Leap do Mhic Léinn na mic léinn a fháil táillí go substaintiúil lascainithe ar Iarnród Éireann, Luas agus Bhus Átha Cliath

source: It is only available to full-time students in second and third level education
ga: Tá sé ar fáil ach do mhic léinn lánaimseartha in oideachas dara agus tríú leibhéal

source: Those claiming free travel must be able to produce a valid Department of Social Protection Travel Pass
ga: Ní foláir do dhaoine atá ag éileamh Saorthaisteal Pas Taistil bailí eisithe ag an Roinn Coimirce Sóisialaí a thaispeáint

source: You can find passenger timetables on the Iarnród Éireann website
ga: Tá cláir ama do phaisinéirí ar fáil ar shuíomh idirlín Iarnróid Éireann
